In [1]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv("../pandas-course/Pandas Course Resources/retail/retail_2016_2017.csv")

In [22]:
df.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944        NaN-          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 48.3+ MB

In [21]:
df.loc[0,"date"] = "NaN-"

In [33]:
df["data"] = pd.to_datetime(df["date"],errors="coerce")

In [29]:
df["data"].dt.strftime("%d/%b/%Y")

0                  NaN
1          01/Jan/2016
2          01/Jan/2016
3          01/Jan/2016
4          01/Jan/2016
              ...
1054939    15/Aug/2017
1054940    15/Aug/2017
1054941    15/Aug/2017
1054942    15/Aug/2017
1054943    15/Aug/2017
Name: data, Length: 1054944, dtype: object

In [35]:
df["data"].dt.day_of_week

0          4
1          4
2          4
3          4
4          4
          ..
1054939    1
1054940    1
1054941    1
1054942    1
1054943    1
Name: data, Length: 1054944, dtype: int32

In [37]:
df["data"].dt.month

0          1
1          1
2          1
3          1
4          1
          ..
1054939    8
1054940    8
1054941    8
1054942    8
1054943    8
Name: data, Length: 1054944, dtype: int32

In [39]:
df["data"].dt.date

0          2016-01-01
1          2016-01-01
2          2016-01-01
3          2016-01-01
4          2016-01-01
              ...
1054939    2017-08-15
1054940    2017-08-15
1054941    2017-08-15
1054942    2017-08-15
1054943    2017-08-15
Name: data, Length: 1054944, dtype: object

In [41]:
df["data"].dt.time

0          00:00:00
1          00:00:00
2          00:00:00
3          00:00:00
4          00:00:00
             ...
1054939    00:00:00
1054940    00:00:00
1054941    00:00:00
1054942    00:00:00
1054943    00:00:00
Name: data, Length: 1054944, dtype: object

In [44]:
dt = pd.to_datetime(df["data"].astype("string")+" 12:56:31")

In [47]:
dt.dt.time.head(5)

0    12:56:31
1    12:56:31
2    12:56:31
3    12:56:31
4    12:56:31
Name: data, dtype: object

In [131]:
tr = pd.read_csv("../pandas-course/Pandas Course Resources/retail/transactions.csv")

In [132]:
tr["date"] = pd.to_datetime(tr["date"])

In [133]:
tr = tr.assign(
    year = tr["date"].dt.year,
    month = tr["date"].dt.month,
    day_of_week = tr["date"].dt.day_of_week)

In [134]:
tr["time_to_last_date"] = tr["date"].max() - tr["date"]

In [135]:
tr["date"] =  tr["date"].dt.strftime("%Y-%B-%d")

In [136]:
tr.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date
0,2013-January-01,25,770,2013,1,1,1687 days
1,2013-January-02,1,2111,2013,1,2,1686 days
2,2013-January-02,2,2358,2013,1,2,1686 days
3,2013-January-02,3,3487,2013,1,2,1686 days
4,2013-January-02,4,1922,2013,1,2,1686 days

In [137]:
tr["time_to_last_date"] = tr["time_to_last_date"]+pd.to_timedelta(3,unit="W")

In [138]:
tr["weeks_to_last_date"] = (tr["time_to_last_date"]/7).dt.days

In [139]:
tr.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date,weeks_to_last_date
0,2013-January-01,25,770,2013,1,1,1708 days,244
1,2013-January-02,1,2111,2013,1,2,1707 days,243
2,2013-January-02,2,2358,2013,1,2,1707 days,243
3,2013-January-02,3,3487,2013,1,2,1707 days,243
4,2013-January-02,4,1922,2013,1,2,1707 days,243

In [144]:
tr["date"] = pd.to_datetime(tr["date"])

In [147]:
tr.set_index("date",inplace=True)

In [157]:
tr.loc["2014-03"]

,store_nbr,transactions,year,month,day_of_week,time_to_last_date,weeks_to_last_date
date,,,,,,,
2014-03-01,1,1111,2014,3,5,1284 days,183
2014-03-01,2,1958,2014,3,5,1284 days,183
2014-03-01,3,3406,2014,3,5,1284 days,183
2014-03-01,4,1650,2014,3,5,1284 days,183
2014-03-01,5,1713,2014,3,5,1284 days,183
...,...,...,...,...,...,...,...
2014-03-31,48,3094,2014,3,0,1254 days,179
2014-03-31,49,2349,2014,3,0,1254 days,179
2014-03-31,50,2485,2014,3,0,1254 days,179
2014-03-31,51,1700,2014,3,0,1254 days,179
2014-03-31,54,888,2014,3,0,1254 days,179

In [165]:
tr.head()

,store_nbr,transactions,year,month,day_of_week,time_to_last_date,weeks_to_last_date
date,,,,,,,
2013-01-01,25,770,2013,1,1,1708 days,244
2013-01-02,1,2111,2013,1,2,1707 days,243
2013-01-02,2,2358,2013,1,2,1707 days,243
2013-01-02,3,3487,2013,1,2,1707 days,243
2013-01-02,4,1922,2013,1,2,1707 days,243

In [169]:
tr.reset_index(inplace=True)

In [183]:
tr.groupby((tr["year"].dt.month,tr["date"].dt.month))["transactions"].mean()

AttributeError: Can only use .dt accessor with datetimelike values

In [188]:
tr.groupby(tr["date"].dt.year)["transactions"].mean()

date
2013    1721.503016
2014    1750.900280
2015    1706.768233
2016    1634.419548
2017    1653.313714
Name: transactions, dtype: float64

In [191]:
tr.groupby([tr["date"].dt.year,tr["date"].dt.month])["transactions"].mean()

date  date
2013  1       1657.898624
      2       1684.483696
      3       1724.181627
      4       1699.206522
      5       1702.874396
      6       1701.426743
      7       1675.012552
      8       1689.182567
      9       1688.270922
      10      1653.013040
      11      1680.756028
      12      2101.323404
2014  1       1696.334515
      2       1731.129939
      3       1748.232830
      4       1762.861450
      5       1751.757873
      6       1701.520567
      7       1667.126962
      8       1738.063014
      9       1712.679021
      10      1682.331989
      11      1701.595833
      12      2117.418750
2015  1       1727.313671
      2       1724.988235
      3       1717.135383
      4       1723.370748
      5       1756.840342
      6       1687.268667
      7       1672.950546
      8       1680.312186
      9       1631.571795
      10      1596.626300
      11      1590.058491
      12      1981.061635
2016  1       1601.083727
      2       1604.292778
      3       1589.066423
      4       1655.218239
      5       1622.737066
      6       1566.706289
      7       1578.872185
      8       1569.375619
      9       1594.878272
      10      1592.686003
      11      1625.652956
      12      2012.576196
2017  1       1642.267756
      2       1649.845013
      3       1631.555082
      4       1666.338538
      5       1673.765830
      6       1647.446296
      7       1663.097969
      8       1649.002469
Name: transactions, dtype: float64